docs/posts/2023-01-21-arara-and-latexmk.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 18, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Arara and Latexmk</title>
<meta name="author" content="Randall Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/neat.css' type='text/css'/>
<link rel='stylesheet' href='/css/custom.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Arara and Latexmk</h1>
<p class="subtitle" role="doc-subtitle">Jan 21, 2023</p>
</header><p>
Compiling LaTeX documents can be a chore, especially if the document has a table of contents, bibliographic references, cross-references, or labels. Getting the final output an be up to a four-step process:
</p>

<ol class="org-ol">
<li>Run pdflatex to to create the labels, table of contents, and undefined bibliographic references.</li>
<li>Run bibtex or biber to get the relevant bibliographic data from the bib files.</li>
<li>Run pdflatex to put that bibliographic data into the document</li>
<li>Run pdflatex again to fix any page numbers that need to change because of the new material.</li>
</ol>

<section id="outline-container-org8711d91" class="outline-2">
<h2 id="org8711d91">Latexmk</h2>
<div class="outline-text-2" id="text-org8711d91">
<p>
Using Latexmk is a great way to automate all of this. Latexmk will do all of these steps as needed, you just need to tell what engine to use (pdfLaTeX, LuaLatex, XeLaTeX) and whether to run Bibtex or Biber. A pdfLaTeX document named &ldquo;sample.tex&rdquo; containing bibliographic references would be compiled from the command line like this:
</p>

<div class="org-src-container">
<pre class="src src-shell">latexmk -pdflatex -bibtex sample.tex
</pre>
</div>

<p>
There are many other options that can be used, making the command to compile even longer. Fortunately, these options can all be set in a latexmkrc file.
</p>

<div class="org-src-container">
<pre class="src src-shell"># LaTeXmk configuration file

# Usage example
# latexmk file.tex

# Main command line options
# -pdflatex : compile with pdflatex
# -lualatex : compile with lualatex
# -pv       : run file previewer
# -pvc      : run file previewer and continually recompile on change
# -c        :
# -C        :clean up auxiliary and output files

# Use bibtex if a .bib file exists
$bibtex_use = 1;

# Define commands to compile with pdfsync support and nonstopmode
$pdflatex = 'pdflatex -synctex=1 --interaction=nonstopmode %O %S';

$lualatex = 'lualatex -synctex=1 --interaction=nonstopmode %O %S';

# Also remove pdfsync files on clean
$clean_ext = '%R.synctex.gz';
</pre>
</div>

<p>
If you always use the same engine to compile, then you can add a line like this to your latexmkrc:
</p>

<div class="org-src-container">
<pre class="src src-shell">$pdf_mode = n
</pre>
</div>

<p>
where n=1 for pdflatex, 4 for lualatex, and 5 for xelatex. The compile command then becomes simply
</p>

<div class="org-src-container">
<pre class="src src-shell">latexmk sample.tex
</pre>
</div>

<p>
Since I use Emacs, I could just add latexmk to the list of TeX commands and compile documents with a simple keystroke. The problem is that I don&rsquo;t do the smart thing and use just one engine. I like to use pdflatex sometimes and lualatex for other documents. It would be nice if I could specify the compiling steps within the document.
</p>
</div>
</section>

<section id="outline-container-org9c700c9" class="outline-2">
<h2 id="org9c700c9">Arara</h2>
<div class="outline-text-2" id="text-org9c700c9">
<p>
Here&rsquo;s where Arara shines. Arara is another way to compile tex files. Unlike latexmk, arara does not do anything automatically. Running
</p>

<div class="org-src-container">
<pre class="src src-shell">arara sample.tex
</pre>
</div>

<p>
doesn&rsquo;t do anything without some special instructions within the file. To compile the file with pdflatex, I would put this as the first line:
</p>

<pre class="example">
% arara: pdflatex: { interaction: nonstopmode, synctex: yes }
</pre>

<p>
Then, running arara on the file would compile once with pdflatex. If I had a bibliography and wanted to use lualatex, I would put this at the top of the file:
</p>

<pre class="example">
% arara: lualatex: { interaction: nonstopmode, synctex: yes }
% arara: biber
% arara: lualatex: { interaction: nonstopmode, synctex: yes }
% arara: lualatex: { interaction: nonstopmode, synctex: yes }
</pre>

<p>
This would get all of the steps that I described above. So, I could compile any file with the same command, and have it compile exactly the way I wanted with the engine that I specified.
</p>

<p>
The problem (and I admit it&rsquo;s a minor one) is that I lose the automation of latexmk. Latexmk does all of the steps automatically, and only <i>if</i> they are needed. Arara does them all every time. Latexmk is smart, but not easily flexible. Arara is very flexible, but not very smart.
</p>
</div>
</section>

<section id="outline-container-orgb0cb6b4" class="outline-2">
<h2 id="orgb0cb6b4">Solution</h2>
<div class="outline-text-2" id="text-orgb0cb6b4">
<p>
Fortunately, arara can be told to compile with latexmk, and the engine and any options can be specified in the file. This compiles with latexmk using pdflatex:
</p>

<pre class="example">
% arara: latexmk: { engine: pdflatex }
</pre>

<p>
Since the options that I want are in my latexmkrc file, there&rsquo;s nothing else I need to do. Changing &ldquo;pdflatex&rdquo; to &ldquo;lualatex&rdquo; would make it compile with lualatex instead as many times as necessary to produce the final document.
</p>
</div>
</section>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 18, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15).
</div>
</footer>
</body>
</html>
